NamJeongkuk/ref_main/src/mini-rx62t/Hardware/Flash/r_flash_type2.c
/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/

static int32_t g_flash_lock2;
static bool g_driver_opened = false;

/* Signals whether FCU firmware has been transferred to the FCU RAM
   0 : No, 1 : Yes */
static uint8_t g_fcu_transfer_complete = 0;
/* Valid values are 'READ_MODE','ROM_PE_MODE' or 'FLD_PE_MODE' */
static uint8_t g_current_mode;
/* Stores whether the peripheral clock notification command has
   been executed */
static uint8_t g_fcu_pclk_command = 0;

#if(FLASH_CFG_IGNORE_LOCK_BITS == 0)
/* Determines whether lock bit protection is used when programming/erasing */
static uint8_t g_lock_bit_protection = true;
#endif

#if((FLASH_CFG_DATA_FLASH_BGO == 1) || (FLASH_CFG_CODE_FLASH_BGO == 1))

/* How many bytes are left to program */
static uint32_t g_bgo_bytes;
/* Where we are programming or erasing */
static uint32_t g_bgo_flash_addr;
/* Where the data is that we are programming */
static uint32_t g_bgo_buffer_addr;
#endif

/* Flash intialisation function prototype */
static uint8_t flash_init(void);
/* Enter PE mode function prototype */
static uint8_t enter_pe_mode(uint32_t flash_addr);
/* Exit PE mode function prototype */
static void exit_pe_mode(uint32_t flash_addr);
/* ROM write function prototype */
static flash_err_t rom_write(uint32_t address, uint32_t data, uint32_t size);
/* Data flash write function prototype */
static flash_err_t data_flash_write(uint32_t address, uint32_t data, uint32_t size);

static bool flash_valid_addr_check(uint32_t block_start_address);

/* Data flash status clear function prototype */
static void data_flash_status_clear(void);
/* Notify peripheral clock function prototype */
static uint8_t notify_peripheral_clock(FCU_BYTE_PTR flash_addr);
/* FCU reset function prototype */
void flash_reset(void);
/* Used to grab flash state */
static uint8_t flash_grab_state(flash_states_t new_state);
/* Used to release flash state */
static void flash_release_state2(void);
/* Used to issue an erase command to the FCU */
static flash_err_t flash_erase_command(FCU_BYTE_PTR const erase_addr);

/* Used to get largest programming size that can be used. */
static uint32_t flash_get_program_size(uint32_t bytes, uint32_t flash_addr);

/* Enables or disables lock bit protection. */
#if((FLASH_CFG_CODE_FLASH_ENABLE == 1) && (FLASH_CFG_IGNORE_LOCK_BITS == 0))
static flash_err_t flash_lockbit_protection(uint32_t lock_bit);
#endif

/* Reads and returns the lock bit status for a ROM block */
flash_err_t flash_lockbit_read(flash_read_lockbit_config_t *lockbit_info);

flash_err_t flash_lockbit_program(flash_program_lockbit_config_t *lockbit_addr);

/* Allow read and program permissions to the Data Flash areas */
void flash_access_window_set(flash_access_window_config_t *pAccessInfo);

/******************************************************************************
* Function Name: flash_init
* Description  : Initializes the FCU peripheral block.
*                NOTE: This function does not have to execute from in RAM.
* Arguments    : none
* Return Value : FLASH_SUCCESS -
*                    Operation Successful
*                FLASH_FAILURE -
*                    Operation Failed
******************************************************************************/
static uint8_t flash_init(void)
{
#if defined(FCU_RAM_INIT_REQUIRED)
   /* Declare source and destination pointers */
   uint32_t *src, *dst;
   /* Declare iteration counter variable */
   uint16_t i;
#endif
   /* Timeout counter. */
   volatile int32_t wait_cnt;

   /* Enable FCU error interrupts in FCU block */
   FLASH.FAEINT.BIT.ROMAEIE = 1;
   FLASH.FAEINT.BIT.CMDLKIE = 1;
   FLASH.FAEINT.BIT.DFLAEIE = 1;
   FLASH.FAEINT.BIT.DFLRPEIE = 1;
   FLASH.FAEINT.BIT.DFLWPEIE = 1;

#if((FLASH_CFG_DATA_FLASH_BGO == 1) || (FLASH_CFG_CODE_FLASH_BGO == 1))
#if((FLASH_CFG_FLASH_READY_IPL == 0) || (FLASH_CFG_FLASH_READY_IPL > 15))
#error "FLASH_CFG_FLASH_READY_IPL in r_flash_rx_config.h must be between 1 and 15 when BGO is enabled."
#endif
   IPR(FCU, FIFERR) = FLASH_CFG_FLASH_READY_IPL;
   IEN(FCU, FIFERR) = 1;
   /* Enable flash ready interrupt (FRDYI) */
   /* Make sure IPL is high enough that interrupt will trigger */
   IPR(FCU, FRDYI) = FLASH_CFG_FLASH_READY_IPL;
   IEN(FCU, FRDYI) = 1;
#else
   /* Disable flash interface error (FIFERR) */
   IPR(FCU, FIFERR) = 0;
   IEN(FCU, FIFERR) = 0;
   /* Disable flash ready interrupt (FRDYI) */
   IPR(FCU, FRDYI) = 0;
   IEN(FCU, FRDYI) = 0;
#endif

   /* Transfer Firmware to the FCU RAM. To use FCU commands, the FCU firmware
        must be stored in the FCU RAM. */

   /* Before writing data to the FCU RAM, clear FENTRYR to stop the FCU. */
   if(FLASH.FENTRYR.WORD != 0x0000)
   {
      /* Disable the FCU from accepting commands - Clear both the
           FENTRY0(ROM) and FENTRYD(Data Flash) bits to 0 */
      FLASH.FENTRYR.WORD = 0xAA00;

      /* Initialize timeout for FENTRYR being written. */
      wait_cnt = FLASH_FENTRYR_TIMEOUT;

      /* Read FENTRYR to ensure it has been set to 0. Note that the top byte
           of the FENTRYR register is not retained and is read as 0x00. */
      while(0x0000 != FLASH.FENTRYR.WORD)
      {
         /* Wait until FENTRYR is 0 unless timeout occurs. */
         if(wait_cnt-- <= 0)
         {
            /* This should not happen. FENTRYR getting written to 0 should
                   only take 2-4 PCLK cycles. */
            return FLASH_ERR_FAILURE;
         }
      }
   }

#if defined(FCU_RAM_INIT_REQUIRED)
   /* Enable the FCU RAM */
   FLASH.FCURAME.WORD = 0xC401;

   /* Copies the FCU firmware to the FCU RAM.
       Source: H'FEFFE000 to H'FF00000 (FCU firmware area)
       Destination: H'007F8000 to H'007FA000 (FCU RAM area) */
   /* Set source pointer */
   src = (uint32_t *)FCU_PRG_TOP;

