NamJeongkuk/ref_main/src/mini-rx62t/Hardware/Flash/r_flash_type2.c
/******************************************************************************
* Function Name: flash_release_state2
* Description  : Release state so another flash operation can take place
*                NOTE1: This function does not have to execute from in RAM. It
*                       must be in RAM though if FLASH_CFG_CODE_FLASH_BGO is
*                       enabled and this function is called during a ROM P/E
*                       operation.
* Arguments    : none
* Return Value : none
******************************************************************************/
static void flash_release_state2(void) __attribute__((section(".flashCode")));
static void flash_release_state2(void)
{
   /* Set current FCU mode to READ */
   g_current_mode = READ_MODE;

   /* Done with programming */
   g_flash_state = FLASH_READY;

   /* Release hold on lock */
   flash_softwareUnlock(&g_flash_lock2);
}
/******************************************************************************
End of function  flash_release_state2
******************************************************************************/

/******************************************************************************
* Function Name: flash_valid_addr_check
* Description  : Checks to see if the input address is actually a valid address.
*                This function checks against the actual memory size of the
*                MCU, not against the maximum. This means that if a memory
*                block is sent in that does not exist for this part, but does
*                for a larger memory variant of this MCU, this function will
*                return an error.
*                NOTE1: This function does not have to execute from in RAM. It
*                       must be in RAM though if FLASH_CFG_CODE_FLASH_BGO is
*                       enabled and this function is called during a ROM P/E
*                       operation.
* Arguments    : block_start_address - the address to validate
* Return Value : true -
*                    Address is valid.
*                false -
*                    Address is not valid.
******************************************************************************/
static bool flash_valid_addr_check(uint32_t block_start_address) __attribute__((section(".flashCode")));
static bool flash_valid_addr_check(uint32_t block_start_address)
{
   if(((block_start_address >= FLASH_DF_BLOCK_0) && (block_start_address < FLASH_DF_BLOCK_INVALID)) ||
      ((block_start_address <= FLASH_CF_BLOCK_0) && (block_start_address > FLASH_CF_BLOCK_INVALID)))
      return (true);
   else
      return (false);
}

#if(FLASH_CFG_IGNORE_LOCK_BITS == 0)
/******************************************************************************
* Function Name: flash_lockbit_protection
* Description  : Enables or disables lock bit protection.
*                NOTE1: This function does not have to execute from in RAM. It
*                       must be in RAM though if FLASH_CFG_CODE_FLASH_BGO is
*                       enabled and this function is called during a ROM P/E
*                       operation.
* Arguments    : lock_bit -
*                    Boolean, whether to enable or disable lock bit
*                    protection (true = enabled, false = disabled)
* Return Value : FLASH_SUCCESS -
*                    Operation Successful
*                FLASH_ERR_BUSY -
*                    Another flash operation is in progress
******************************************************************************/
static flash_err_t flash_lockbit_protection(uint32_t lock_bit) __attribute__((section(".flashCode")));
static flash_err_t flash_lockbit_protection(uint32_t lock_bit)
{
#if(FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
   if(lock_bit > 1)
   {
      return FLASH_ERR_PARAM;
   }
#endif

   /* Attempt to grab state */;
   if(flash_grab_state(FLASH_LOCK_BIT) != FLASH_SUCCESS)
   {
      /* Another operation is already in progress */
      return FLASH_ERR_BUSY;
   }

   /* Enable or disable? */
   g_lock_bit_protection = lock_bit;

   /* Release state */
   flash_release_state2();

   /* Return success */
   return FLASH_SUCCESS;
}
#endif
/******************************************************************************
End of function  flash_lockbit_protection
******************************************************************************/

#if(FLASH_CFG_DATA_FLASH_BGO == 1) || ((FLASH_CFG_CODE_FLASH_BGO == 1) && (FLASH_CFG_CODE_FLASH_ENABLE == 1))
/******************************************************************************
* Function Name: Excep_FCU_FIFERR
* Description  : ISR that is called when FCU is done with flash operation
*                and a failure occurred.
* Arguments    : none
* Return Value : none
******************************************************************************/
void FCUIF_FIFERR(void) __attribute__((section(".flashCode"))) __attribute__((interrupt));
void FCUIF_FIFERR(void)
{
   /* Leave Program/Erase Mode and clear any error flags */
   exit_pe_mode(g_bgo_flash_addr);

   /* Release flash state */
   flash_release_state2();

   /* Operation failure, use callback function to alert user */
   FlashError();

   /* Exit ISR */
   return;
}

/******************************************************************************
* Function Name: Excep_FCU_FRDYI
* Description  : ISR that is called when FCU is done with flash operation
*                NOTE: This function MUST execute from RAM only when
*                      FLASH_CFG_CODE_FLASH_BGO is enabled.
* Arguments    : none
* Return Value : none
******************************************************************************/
// #pragma interrupt Excep_FCU_FRDYI(vect = VECT(FCU, FRDYI))
void FCUIF_FRDYI(void) __attribute__((section(".flashCode"))) __attribute__((interrupt));
void FCUIF_FRDYI(void)
{
   /* Local variables */
   uint32_t num_byte_to_write;
   uint8_t ret;
#ifdef FLASH_CFG_FLASH_TO_FLASH
   uint32_t i;
#endif
   rom_block_info_t block_info;
   uint32_t block_number, bytes_erased;

   /* Check for any errors */
   if((FLASH.FSTATR0.BIT.ILGLERR == 1) ||
      (FLASH.FSTATR0.BIT.ERSERR == 1) ||
      (FLASH.FSTATR0.BIT.PRGERR == 1))
   {
      /* Should never get here with FIFERR enabled */
      __asm("nop");
      // nop();
   }

