NamJeongkuk/ref_main/src/mini-rx62t/Hardware/Flash/r_flash_type2.c
      /* Set FENTRYD bit(Bit 7) and FKEY (B8-15 = 0xAA) */
      FLASH.FENTRYR.WORD = 0xAA80;

      /*  First clear the FCU's status before doing Data Flash programming.
            This is to clear out any previous errors that may have occured.
            For example, if you attempt to read the Data Flash area
            before you make it readable using R_FlashDataAreaAccess(). */
      data_flash_status_clear();
   }
   /* Catch-all for invalid FCU mode */
   else
   {
      /* Invalid value of 'g_current_mode' */
      return FLASH_ERR_FAILURE;
   }

   /* Enable Write/Erase of ROM/Data Flash */
   FLASH.FWEPROR.BYTE = 0x01;

   /* Check for FCU error */
   if((FLASH.FSTATR0.BIT.ILGLERR == 1) || (FLASH.FSTATR0.BIT.ERSERR == 1) || (FLASH.FSTATR0.BIT.PRGERR == 1) || (FLASH.FSTATR1.BIT.FCUERR == 1))
   {
      /* Return FLASH_FAILURE, operation failure */
      return FLASH_ERR_FAILURE;
   }

   /* Check to see if peripheral clock notification command is needed */
   if(g_fcu_pclk_command == 0)
   {
      /* Disable FCU interrupts, so interrupt will not trigger after
           peripheral clock notification command */
      FLASH.FRDYIE.BIT.FRDYIE = 0;

      /* Inform FCU of flash clock speed, check if operation is succesful */
      if(notify_peripheral_clock((FCU_BYTE_PTR)flash_addr) != 0)
      {
         /* Return FLASH_FAILURE, operation failure */
         return FLASH_ERR_FAILURE;
      }

      /* Only re-enable flash ready interrupt if using BGO */
#if(FLASH_CFG_DATA_FLASH_BGO == 1)
      if(g_current_mode == FLD_PE_MODE)
      {
         /* Re-enable the FRDYI interrupt */
         FLASH.FRDYIE.BIT.FRDYIE = 1;
      }
#endif
#if(FLASH_CFG_CODE_FLASH_BGO == 1)
      if(g_current_mode == ROM_PE_MODE)
      {
         /* Don't enable flash interrupts if programming lock bits */
         if(g_flash_state != FLASH_LOCK_BIT)
         {
            /* Re-enable the FRDYI interrupt */
            FLASH.FRDYIE.BIT.FRDYIE = 1;
         }
      }
#endif

      /* No need to notify FCU of clock supplied to flash again */
      g_fcu_pclk_command = 1;
   }

   /* Return FLASH_SUCCESS, operation successful */
   return FLASH_SUCCESS;
}
/******************************************************************************
End of function enter_pe_mode
******************************************************************************/

/******************************************************************************
* Function Name: exit_pe_mode
* Description  : Takes the FCU out of program/erase mode.
*                NOTE: This function MUST execute from in RAM for 'ROM Area'
*                programming, but if you are ONLY doing Data Flash
*                programming, this function can reside and execute in Flash.
* Arguments    : flash_addr -
*                    The programming/erasure address
* Return Value : none
******************************************************************************/
static void exit_pe_mode(uint32_t flash_addr) __attribute__((section(".flashCode")));
static void exit_pe_mode(uint32_t flash_addr)
{
   /* Declare wait timer count variable */
   volatile int32_t wait_cnt;

   /* Declare address pointer */
   FCU_BYTE_PTR p_addr;

   /* Cast flash address so that it can be used as pointer and will be
       accessed correctly. */
   p_addr = (FCU_BYTE_PTR)flash_addr;

   /* Set wait timer count duration */
   wait_cnt = WAIT_MAX_ERASE;

   /* Iterate while loop whilst FCU operation is in progress */
   while(FLASH.FSTATR0.BIT.FRDY == 0)
   {
      /* Decrement wait timer count variable */
      wait_cnt--;

      /* Check if wait timer count value has reached zero */
      if(wait_cnt == 0)
      {
         /* Timeout duration has elapsed, assuming operation failure and
               resetting the FCU */
         flash_reset();

         /* Break from the while loop prematurely */
         break;
      }
   }

   /* Check FSTATR0 and execute a status register clear command if needed */
   if((FLASH.FSTATR0.BIT.ILGLERR == 1) || (FLASH.FSTATR0.BIT.ERSERR == 1) || (FLASH.FSTATR0.BIT.PRGERR == 1))
   {
      /* Clear ILGLERR */
      if(FLASH.FSTATR0.BIT.ILGLERR == 1)
      {
         /* FASTAT must be set to 0x10 before the status clear command
               can be successfully issued  */
         if(FLASH.FASTAT.BYTE != 0x10)
         {
            /* Set the FASTAT register to 0x10 so that a status clear
                    command can be issued */
            FLASH.FASTAT.BYTE = 0x10;
         }
      }

      /* Send status clear command to FCU */
      *p_addr = 0x50;
   }

   /* Enter ROM Read mode */
   FLASH.FENTRYR.WORD = 0xAA00;

   /* Initialize timeout for FENTRYR being written. */
   wait_cnt = FLASH_FENTRYR_TIMEOUT;

   /* Read FENTRYR to ensure it has been set to 0. Note that the top byte
       of the FENTRYR register is not retained and is read as 0x00. */
   while(0x0000 != FLASH.FENTRYR.WORD)
   {
      /* Wait until FENTRYR is 0 unless timeout occurs. */
      if(wait_cnt-- <= 0)
      {
         /* This should not happen. FENTRYR getting written to 0 should
               only take 2-4 PCLK cycles. Could add a call to FlashError()
               here if user wants to process this. */
         break;
      }
   }

   /* Disable the FRDYI interrupt */
   FLASH.FRDYIE.BIT.FRDYIE = 0;

   /* Flash write/erase disabled */
   FLASH.FWEPROR.BYTE = 0x02;
}

/******************************************************************************
* Function Name: flash_get_romBlock_size
* Description  : Return the size of the ROM block for this address, as well as
*                the starting and ending addresses for this block.
* Arguments    : romaddr -The address for which the rom block info is being requested
*                rom_block_info_t* block_info - ptr to a rom_block_info_t structure
*                                  which will hold the block info
* Return Value : 0   Invalid address supplied
*                    Block size otherwise
******************************************************************************/
uint32_t flash_get_romBlock_size(uint32_t romaddr, rom_block_info_t *pblock_info) __attribute__((section(".flashCode")));
uint32_t flash_get_romBlock_size(uint32_t romaddr, rom_block_info_t *pblock_info)
{
   uint16_t index = 0;
   volatile rom_block_sizes_t block_info;
   volatile uint32_t total_section_size;
   volatile uint32_t this_section_blockSt = 0;

   if(pblock_info == NULL)
      return (0);

   block_info = g_flash_RomBlockSizes[0];
   total_section_size = block_info.block_size * block_info.num_blocks;

   pblock_info->end_addr = FLASH_CF_BLOCK_0 + block_info.block_size - 1;
   pblock_info->start_addr = (pblock_info->end_addr - (total_section_size)) + 1;
   pblock_info->block_number = 0;

   for(index = 1; index < NUM_BLOCK_TABLE_ENTRIES; index++)
   {
      // Is this address in this block range?
      if((romaddr >= pblock_info->start_addr) && (romaddr <= pblock_info->end_addr))
         break;
      pblock_info->block_number += block_info.num_blocks;
      this_section_blockSt = block_info.num_blocks - 1;
      block_info = g_flash_RomBlockSizes[index];
      total_section_size = block_info.block_size * block_info.num_blocks;
      pblock_info->end_addr = pblock_info->start_addr - 1;
      pblock_info->start_addr -= total_section_size;
   }

   pblock_info->block_number += ((pblock_info->end_addr - romaddr) / block_info.block_size);
   pblock_info->thisblock_stAddr = (pblock_info->end_addr - (pblock_info->block_number - this_section_blockSt) * block_info.block_size) + 1;
   pblock_info->block_size = block_info.block_size;
   return (block_info.block_size);
}
/******************************************************************************
End of function  flash_get_romBlock_size
******************************************************************************/

