NamJeongkuk/ref_main/src/mini-rx62t/Hardware/Flash/r_flash_type2.c
/******************************************************************************
* Function Name: flash_get_romBlock_info
* Description  : Return the details for the supplied Rom block number
*                the starting and ending addresses for this block.
* Arguments    : block_number - A valid ROM block number
*                rom_block_info_t* block_info - ptr to a rom_block_info_t structure
*                                  which will hold the block info.
* Return Value : False   Invalid block supplied
*                True -  supplied block_info structure holds the block info
******************************************************************************/
bool flash_get_romBlock_info(uint32_t block_number, rom_block_info_t *pblock_info) __attribute__((section(".flashCode")));
bool flash_get_romBlock_info(uint32_t block_number, rom_block_info_t *pblock_info)
{
   uint16_t this_block = 0;
   rom_block_sizes_t bl_info = g_flash_RomBlockSizes[0];
   //    volatile uint32_t total_section_size = bl_info.block_size * bl_info.num_blocks;
   //    volatile uint32_t this_section_blockSt = 0;
   volatile uint32_t section_counter = 0;
   volatile uint32_t blksize_counter = 0;

   if(block_number > ROM_NUM_BLOCKS)
      return (false);

   pblock_info->end_addr = FLASH_CF_BLOCK_0 + bl_info.block_size - 1;
   pblock_info->start_addr = FLASH_CF_BLOCK_0;
   pblock_info->block_size = bl_info.block_size;

   for(this_block = 0; this_block < ROM_NUM_BLOCKS; this_block++)
   {
      if(this_block == block_number)
         break;

      if(blksize_counter++ == bl_info.num_blocks - 1)
      {
         bl_info = g_flash_RomBlockSizes[++section_counter];
         blksize_counter = 0;
      }
      pblock_info->end_addr = pblock_info->start_addr - 1;
      pblock_info->start_addr -= bl_info.block_size;
      pblock_info->block_size = bl_info.block_size;
   }

   return (true);
}
/******************************************************************************
End of function  flash_get_romBlock_info
******************************************************************************/

/***********************************************************************************************************************
* Function Name: flash_api_erase
* Description  : This function executes specific functionality to erase the specified Code or Data Flash blocks.
* Arguments    : uint32_t block_start_address -
*                 Start address of the first block. Actual address or entry from "flash_block_address_t" enum can be used
*                uint32_t num_blocks -
*                 For FCU based MCU's the number of blocks is always 1.
*                 Only a single block may be erased at a time.
* Return Value : FLASH_SUCCESS -
*                    Erase completed successfully; successfully initialized in case of BGO mode.
*                FLASH_ERR_ADRRESS -
*                    Start address is an invalid Code/Data Flash block start address
*                FLASH_ERR_BOUNDARY - The block_start_address and accompanying num_blocks cross one of the
*                                     defined ROM AREA boundaries.
*                FLASH_ERR_BUSY -
*                    Flash peripheral is busy with another operation
*                FLASH_ERR_FAILURE
*                    Flash Write operation failed for some other reason. This can be a result of trying to erase an area
*                    that has been protected via access control.
***********************************************************************************************************************/
flash_err_t flash_api_erase(flash_block_address_t block_start_address, uint32_t num_blocks) __attribute__((section(".flashCode")));
flash_err_t flash_api_erase(flash_block_address_t block_start_address, uint32_t num_blocks)
{
   flash_err_t result = FLASH_SUCCESS;
   uint32_t p_addr = (uint32_t)block_start_address; /* Declare address pointer */
   rom_block_info_t block_info;
   uint32_t blockcnt = 0;
   uint32_t block_number;
   uint32_t initial_block_number = 0;
   uint32_t entry_address;
#if(FLASH_CFG_CODE_FLASH_BGO == 1)
   uint32_t block_size;
#endif

   volatile int32_t bytes_to_erase = (int32_t)(FLASH_DF_BLOCK_1 - FLASH_DF_BLOCK_0) * num_blocks; // for DF this is correct

   /* Take off upper byte since for programming/erase addresses for ROM are
          the same as read addresses except upper byte is masked off to 0's.
          Data Flash addresses are not affected. */
   block_start_address &= 0x00FFFFFF;
   entry_address = block_start_address;

   if(num_blocks == 0)
   {
      return (FLASH_ERR_BLOCKS);
   }

   if(flash_valid_addr_check(block_start_address) == true)
   {
      /* Do we want to erase a Data Flash block or ROM block? */
      if((block_start_address >= FLASH_DF_BLOCK_0) && (block_start_address < FLASH_DF_BLOCK_INVALID))
      {
         /* Set current FCU mode to data flash PE */
         g_current_mode = FLD_PE_MODE;

         /* Check to make sure erase will not go over the end of DF. */
         if((block_start_address + bytes_to_erase) > (DF_ADDRESS + MCU_DATA_FLASH_SIZE_BYTES))
         {
            return FLASH_ERR_OVERFLOW;
         }

         /* Verify address is on block boundary */
         if((block_start_address & (FLASH_DF_BLOCK_SIZE - 1)) != 0)
         {
            return FLASH_ERR_ADDRESS;
         }
#if(FLASH_CFG_DATA_FLASH_BGO == 1)
         /* Set global variables so that erase can continue in ISR. Set these first so that if the Erase generates an error the
              * error ISR will have the correct address to use in clearing the error flag (the one provided to enter_pe_mode() */
         g_bgo_flash_addr = p_addr + DF_ERASE_BLOCK_SIZE;
         g_bgo_bytes = bytes_to_erase - DF_ERASE_BLOCK_SIZE;
#endif
      }
      else
      {
         /* Set current FCU mode to ROM PE */
         g_current_mode = ROM_PE_MODE;

         // Calculate the total # of bytes to erase,  blocks may differ in sizes.
         bytes_to_erase = flash_get_romBlock_size(block_start_address, &block_info);
         initial_block_number = block_number = block_info.block_number;

         for(blockcnt = 0; blockcnt < num_blocks - 1; blockcnt++)
         {
            block_number--;
            // We now have the block number for this address
            if(flash_get_romBlock_info(block_number, &block_info) == false)
            {
               return (FLASH_ERR_ADDRESS);
            }
            bytes_to_erase += block_info.block_size;
         }

         /* Check to make sure erase will not go over the end of CF. */
         if((block_start_address + bytes_to_erase) > (ROM_PE_ADDR + MCU_ROM_SIZE_BYTES))
         {
            return FLASH_ERR_OVERFLOW;
         }

         /* Check for attempts to program over flash area boundaries. These
                boundaries are defined in r_flash_rx*MCU Group*.h as 'ROM_AREA_#'.
                Use ">" rather than ">=" because "bytes" does not include "flash_addr". */
         if(((block_start_address < (ROM_AREA_0)) && ((block_start_address + bytes_to_erase) > ROM_AREA_0))
#if defined(ROM_AREA_1)
            || ((block_start_address < (ROM_AREA_1)) && ((block_start_address + bytes_to_erase) > ROM_AREA_1))
#endif
#if defined(ROM_AREA_2)
            || ((block_start_address < (ROM_AREA_2)) && ((block_start_address + bytes_to_erase) > ROM_AREA_2))
#endif
#if defined(ROM_AREA_3)
            || ((block_start_address < (ROM_AREA_3)) && ((block_start_address + bytes_to_erase) > ROM_AREA_3))
#endif
         )
         {
            /* Return cannot write across a flash area boundary */
            return FLASH_ERR_BOUNDARY;
         }
#if(FLASH_CFG_CODE_FLASH_BGO == 1)
         /* Set global variables so that erase can continue in ISR. Set these first so that if the Erase generates an error the
         * error ISR will have the correct address to use in clearing the error flag (the one provided to enter_pe_mode() */
         block_size = flash_get_romBlock_size(block_start_address, &block_info);
         g_bgo_flash_addr = p_addr + block_size;
         g_bgo_bytes = bytes_to_erase - block_size;

#endif
      }

      /* Attempt to grab state */
      if(flash_grab_state(FLASH_ERASING) != FLASH_SUCCESS)
      {
         /* Another operation is already in progress */
         return FLASH_ERR_BUSY;
      }

      /* Enter ROM PE mode, check if operation successful */
      if(enter_pe_mode(block_start_address) != FLASH_SUCCESS)
      {
         /* Make sure part is in ROM read mode. */
         exit_pe_mode(block_start_address);

         /* Release state */
         flash_release_state2();

         /* Return FLASH_FAILURE, operation failure */
         return FLASH_ERR_FAILURE;
      }

#if(FLASH_CFG_IGNORE_LOCK_BITS == 1)
      /* Cancel the ROM Protect feature
           NOTE: If you are using block locking feature to protect your data,
           then comment out 'FLASH_CFG_IGNORE_LOCK_BITS' in r_flash_rx_config.h */
      FLASH.FPROTR.WORD = 0x5501;
#else
      /* Only disable lock bit protection if user has specified to
           do so earlier */
      if(g_lock_bit_protection == false)
      {
         /* Cancel the ROM Protect feature */
         FLASH.FPROTR.WORD = 0x5501;
      }
#endif

      block_number = initial_block_number;
      while(0 < bytes_to_erase)
      {
         /* Send FCU command to erase block */
         result = flash_erase_command((FCU_BYTE_PTR)block_start_address);
         if(result != FLASH_SUCCESS)
            break;

         if(g_current_mode == ROM_PE_MODE)
         {
#if(FLASH_CFG_CODE_FLASH_BGO == 1)
            break;
#endif

            // Code Flash Erase
            /* Advance pointer to next block */
            block_number--;

            // Decrease by the amount we just wrote
            bytes_to_erase -= (int32_t)block_info.block_size;

            if(bytes_to_erase == 0)
            {
               break;
            }

            if(flash_get_romBlock_info(block_number, &block_info) == false)
            {
               return (FLASH_ERR_ADDRESS);
            }
            block_start_address = (flash_block_address_t)block_info.start_addr;
         }
         else
         {
#if(FLASH_CFG_DATA_FLASH_BGO == 1)
            break;
#endif
            // Data Flash Erase
            /* Advance pointer to next block */
            block_start_address += DF_ERASE_BLOCK_SIZE;

            /* Subtract off bytes erased */
            bytes_to_erase -= DF_ERASE_BLOCK_SIZE;
         }
      }

#if(FLASH_CFG_CODE_FLASH_BGO == 1)
      if(g_current_mode == ROM_PE_MODE)
      {
         /* Return, check result later in ISR */
         return FLASH_SUCCESS;
      }
#endif

