NamJeongkuk/ref_main/src/mini-rx62t/Hardware/Flash/r_flash_type2.c
#if(FLASH_CFG_DATA_FLASH_BGO == 1)
      if(g_current_mode == FLD_PE_MODE)
      {
         /* Return, check result later in ISR */
         return FLASH_SUCCESS;
      }

#endif
   }
   else
   {
      return FLASH_ERR_ADDRESS;
   }

   /* Leave Program/Erase Mode */
   exit_pe_mode(entry_address);

   /* Release state */
   flash_release_state2();

   /* Return erase result */
   return result;
}

/******************************************************************************
* Function Name: flash_erase_command
* Description  : Issues the FCU command to erase a flash block
*                NOTE: This function MUST execute from in RAM for 'ROM Area'
*                programming, but if you are ONLY doing Data Flash programming,
*                this function can reside and execute in Flash.
* Arguments    : erase_addr -
*                    An address in the block to be erased
* Return Value : FLASH_SUCCESS -
*                    Operation Successful
*                FLASH_FAILURE -
*                    Operation Failed
******************************************************************************/
static flash_err_t flash_erase_command(FCU_BYTE_PTR const erase_addr) __attribute__((section(".flashCode")));
static flash_err_t flash_erase_command(FCU_BYTE_PTR const erase_addr)
{
   /* Declare timer wait count variable */
   volatile int32_t wait_cnt;
   /* Declare erase operation result container variable */
   flash_err_t result = FLASH_SUCCESS;

   /* Send the FCU Command */
   *erase_addr = 0x20;
   *erase_addr = 0xD0;

#if(FLASH_CFG_CODE_FLASH_BGO == 1)
   if(g_current_mode == ROM_PE_MODE)
   {
      /* Return, check result later in ISR */
      return FLASH_SUCCESS;
   }
#endif

#if(FLASH_CFG_DATA_FLASH_BGO == 1)
   if(g_current_mode == FLD_PE_MODE)
   {
      /* Return, check result later in ISR */
      return FLASH_SUCCESS;
   }
#endif

   /* Set the wait counter timeout duration */
   wait_cnt = WAIT_MAX_ERASE;

   /* Wait while FCU operation is in progress */
   while(FLASH.FSTATR0.BIT.FRDY == 0)
   {
      /* Decrement the wait counter */
      wait_cnt--;

      /* Check if the wait counter has reached zero */
      if(wait_cnt == 0)
      {
         /* Maximum timeout duration for erasing a ROM block has
               elapsed, assuming operation failure - reset the FCU */
         flash_reset();

         /* Return FLASH_FAILURE, operation failure */
         return FLASH_ERR_FAILURE;
      }
   }

   /* Check if erase operation was successful by checking
       bit 'ERSERR' (bit5) and 'ILGLERR' (bit 6) of register 'FSTATR0' */
   /* Check FCU error */
   if((FLASH.FSTATR0.BIT.ILGLERR == 1) || (FLASH.FSTATR0.BIT.ERSERR == 1))
   {
      result = FLASH_ERR_FAILURE;
   }

   /* Return erase result */
   return result;
}

/****************************************************************************************
* Function Name: flash_api_write()
* Description  : This function executes RX specific functionality to write into flash
*                NOTE: This function MUST execute from in RAM for 'ROM Area'
*                programming, but if you are ONLY doing Data Flash programming,
*                this function can reside and execute in Flash.
* Arguments    : buffer_addr -
*                    Address location of data buffer to write into flash.
*
*                flash_addr -
*                    Flash address location to write to. This address
*                    must be on a program boundary (e.g. RX62N has
*                    256-byte ROM writes and 8-byte DF writes).
*                bytes -
*                    The number of bytes to write. You must always pass a
*                    multiple of the programming size (e.g. RX62N has
*                    256-byte ROM writes and 8-byte DF writes).
* Return Value : FLASH_SUCCESS -
*                    Operation Successful.
*                FLASH_FAILURE -
*                    Operation Failed
*                FLASH_ERR_ALIGNED -
*                    Flash address was not on correct boundary
*                FLASH_ERR_BYTES -
*                    Number of bytes did not match programming size of ROM or DF
*                FLASH_ERR_ADRRESS -
*                    Invalid address
*                FLASH_ERR_BOUNDARY -
*                    (ROM) Cannot write across flash areas.
*                FLASH_ERR_BUSY -
*                    Flash is busy with another operation
*
******************************************************************************/
flash_err_t flash_api_write(uint32_t buffer_addr, uint32_t flash_addr, uint32_t bytes) __attribute__((section(".flashCode")));
flash_err_t flash_api_write(uint32_t buffer_addr, uint32_t flash_addr, uint32_t bytes)
{
   flash_err_t result = FLASH_SUCCESS;
   uint32_t entry_address;

   /* Declare result container and number of bytes to write variables */
   uint32_t num_byte_to_write;
#ifdef FLASH_CFG_FLASH_TO_FLASH
   /* Local variable when using FLASH_CFG_FLASH_TO_FLASH */
   uint16_t i;
#endif

   /* Take off upper byte since for programming/erase addresses for ROM are
        the same as read addresses except upper byte is masked off to 0's.
        Data Flash addresses are not affected. */
   flash_addr &= 0x00FFFFFF;
   entry_address = flash_addr;

   /* Make sure 'bytes' is not 0. */
   if(bytes == 0)
   {
      return FLASH_ERR_BYTES;
   }

   /* ROM area or Data Flash area - Check for DF first */
   if((flash_addr >= FLASH_DF_BLOCK_0) && (flash_addr < FLASH_DF_BLOCK_INVALID))
   {
      /* Check if the number of bytes were passed is a multiple of the
           programming size for the data flash */
      if(bytes & (DF_PROGRAM_SIZE_SMALL - 1))
      {
         /* Return number of bytes not a multiple of the programming size */
         return FLASH_ERR_BYTES;
      }
      /* Check for an address on a programming boundary. */
      if(flash_addr & (DF_PROGRAM_SIZE_SMALL - 1))
      {
         /* Return address not on a programming boundary */
         return FLASH_ERR_ALIGNED;
      }

      /* Check to make sure erase will not go over the end of DF. */
      if((flash_addr + bytes) > (DF_ADDRESS + MCU_DATA_FLASH_SIZE_BYTES))
      {
         return FLASH_ERR_OVERFLOW;
      }

      /* Set current FCU mode to data flash PE */
      g_current_mode = FLD_PE_MODE;
   }
   /* Check for ROM area */
   else if((flash_addr >= ROM_PE_ADDR) && (flash_addr < ROM_PE_ADDR + MCU_ROM_SIZE_BYTES))
   {
      /* First make sure that ROM operations are enabled. */
#if(FLASH_CFG_CODE_FLASH_ENABLE == 0)
      /* ROM operations are not enabled! Enable them in r_flash_rx_config.h */
      return FLASH_ERR_FAILURE;
#endif

