NamJeongkuk/ref_main/src/mini-rx62t/Hardware/Flash/r_flash_type2.c
      /* Check if the number of bytes were passed is a multiple of the
           programming size for ROM */
      if(bytes & (ROM_PROGRAM_SIZE - 1))
      {
         /* Return number of bytes not a multiple of the programming size */
         return FLASH_ERR_BYTES;
      }

      /* Check for an address on a programming boundary. */
      if(flash_addr & (ROM_PROGRAM_SIZE - 1))
      {
         /* Return address not on a ROM programming byte boundary */
         return FLASH_ERR_ALIGNED;
      }

      /* Check for attempts to program over flash area boundaries. These
           boundaries are defined in r_flash_rx*MCU Group*.h as 'ROM_AREA_#'.
           Use ">" rather than ">=" because "bytes" does not include "flash_addr". */
      if(((flash_addr < (ROM_AREA_0)) && ((flash_addr + bytes) > ROM_AREA_0))
#if defined(ROM_AREA_1)
         || ((flash_addr < (ROM_AREA_1)) && ((flash_addr + bytes) > ROM_AREA_1))
#endif
#if defined(ROM_AREA_2)
         || ((flash_addr < (ROM_AREA_2)) && ((flash_addr + bytes) > ROM_AREA_2))
#endif
#if defined(ROM_AREA_3)
         || ((flash_addr < (ROM_AREA_3)) && ((flash_addr + bytes) > ROM_AREA_3))
#endif
      )
      {
         /* Return cannot write across a flash area boundary */
         return FLASH_ERR_BOUNDARY;
      }

      /* Make sure write is not going over end of flash. */
      if((flash_addr + bytes) > (ROM_PE_ADDR + MCU_ROM_SIZE_BYTES))
      {
         return FLASH_ERR_OVERFLOW;
      }

      /* Set FCU to ROM PE mode */
      g_current_mode = ROM_PE_MODE;
   }
   else
   {
      /* Return invalid flash address */
      return FLASH_ERR_ADDRESS;
   }

   /* Attempt to grab state */
   if(flash_grab_state(FLASH_WRITING) != FLASH_SUCCESS)
   {
      /* Another operation is already in progress */
      return FLASH_ERR_BUSY;
   }

#ifdef FLASH_CFG_FLASH_TO_FLASH
   /* Are we doing a ROM to ROM or DF to DF transfer? */
   if((buffer_addr >= ROM_PE_ADDR) ||
      ((buffer_addr >= DF_ADDRESS) && (buffer_addr < (DF_ADDRESS + MCU_DATA_FLASH_SIZE_BYTES))))
   {
      /* Buffering is needed. */
      /* Get maximum programming size that can currently be used. */
      num_byte_to_write = flash_get_program_size(bytes, flash_addr);

      /* Copy over first buffer */
      for(i = 0; i < num_byte_to_write; i++)
      {
         /* Copy over each byte */
         g_temp_array[i] = *((uint8_t *)(buffer_addr + i));
      }

      /* Check size */
      if(bytes == num_byte_to_write)
      {
         /* Since we were able to put the entire buffer in RAM we can
               just change the buffer pointer and go on as usual. */
         g_flash_to_flash_op = 0;

         /* Set new buffer address */
         buffer_addr = (uint32_t)&g_temp_array[0];
      }
      else
      {
         /* Set FLASH_CFG_FLASH_TO_FLASH flag */
         g_flash_to_flash_op = 1;
      }
   }
   else
   {
      /* No need to buffer */
      g_flash_to_flash_op = 0;
   }

#endif /* FLASH_CFG_FLASH_TO_FLASH */

   /* Enter PE mode, check if operation is successful */
   if(enter_pe_mode(flash_addr) != FLASH_SUCCESS)
   {
      /* Make sure part is in ROM read mode. */
      exit_pe_mode(flash_addr);

      /* Release state */
      flash_release_state2();

      /* Return operation failure */
      return FLASH_ERR_FAILURE;
   }

#if(FLASH_CFG_IGNORE_LOCK_BITS == 1)
   /* Cancel the ROM Protect feature
       NOTE: If you are using block locking feature to protect your data,
       then set  'FLASH_CFG_IGNORE_LOCK_BITS' to 0 in r_flash_rx_config.h */
   FLASH.FPROTR.WORD = 0x5501;
#else
   /* Only disable lock bit protection if user has specified to
       do so earlier */
   if(g_lock_bit_protection == false)
   {
      /* Cancel the ROM Protect feature */
      FLASH.FPROTR.WORD = 0x5501;
   }
#endif

   /* Iterate while there are still bytes remaining to write */
   while(bytes)
   {
      /* Get maximum programming size that can currently be used. */
      num_byte_to_write = flash_get_program_size((uint32_t)bytes, flash_addr);

#if(FLASH_CFG_DATA_FLASH_BGO == 1)
      if(g_current_mode == FLD_PE_MODE)
      {
         /* At this point we are going to set some global variables which
               will continue on with write after these bytes are written.
               I set these values before the actual first write because I was
               getting an error when the flash ready interrupt was being called
               before these values were set. */
         g_bgo_flash_addr = flash_addr + num_byte_to_write;
         g_bgo_buffer_addr = buffer_addr + num_byte_to_write;
         g_bgo_bytes = bytes - num_byte_to_write;
      }
#endif

#if(FLASH_CFG_CODE_FLASH_BGO == 1)
      if(g_current_mode == ROM_PE_MODE)
      {
         /* At this point we are going to set some global variables which
               will continue on with write after these bytes are written.
               I set these values before the actual first write because I was
               getting an error when the flash ready interrupt was being called
               before these values were set. */
         g_bgo_flash_addr = flash_addr + num_byte_to_write;
         g_bgo_buffer_addr = buffer_addr + num_byte_to_write;
         g_bgo_bytes = bytes - num_byte_to_write;
      }
#endif

      /* Call the Programming function, store the operation status in the
           container variable, result */
#if(FLASH_CFG_FLASH_TO_FLASH == 1)
      if(g_flash_to_flash_op == 1)
      {
         if(g_current_mode == FLD_PE_MODE)
         {
            result = data_flash_write(flash_addr, (uint32_t)&g_temp_array[0], num_byte_to_write);
         }
         else
         {
            result = rom_write(flash_addr, (uint32_t)&g_temp_array[0], num_byte_to_write);
         }
      }
      else
      {
         if(g_current_mode == FLD_PE_MODE)
         {
            result = data_flash_write(flash_addr, buffer_addr, num_byte_to_write);
         }
         else
         {
            result = rom_write(flash_addr, buffer_addr, num_byte_to_write);
         }
      }
#else
      if(g_current_mode == FLD_PE_MODE)
      {
         result = data_flash_write(flash_addr, buffer_addr, num_byte_to_write);
      }
      else
      {
         result = rom_write(flash_addr, buffer_addr, num_byte_to_write);
      }
#endif

      /* Check the container variable result for errors */
      if(result != FLASH_SUCCESS)
      {
         /* Data flash write error detected, break from flash write
               while loop prematurely */
         break;
      }

