NamJeongkuk/ref_main/src/mini-rx62t/Hardware/Flash/r_flash_type2.c
#if(FLASH_CFG_DATA_FLASH_BGO == 1)
      if(g_current_mode == FLD_PE_MODE)
      {
         /* Return FLASH_SUCCESS, rest of programming will be done
               in interrupt */
         return FLASH_SUCCESS;
      }
#endif
#if(FLASH_CFG_CODE_FLASH_BGO == 1)
      if(g_current_mode == ROM_PE_MODE)
      {
         /* Return FLASH_SUCCESS, rest of programming will be done
               in interrupt */
         return FLASH_SUCCESS;
      }
#endif

#if((FLASH_CFG_CODE_FLASH_BGO == 0)) || ((FLASH_CFG_DATA_FLASH_BGO == 0))

      /* Increment the flash address and the buffer address by the size
           of the transfer thats just completed */
      flash_addr += num_byte_to_write;
      buffer_addr += num_byte_to_write;

      /* Decrement the number of bytes remaining by the size of the last
           flash write */
      bytes -= num_byte_to_write;

#ifdef FLASH_CFG_FLASH_TO_FLASH
      /* Check to see if we need to buffer more data */
      if((bytes > 0) &&
         (g_flash_to_flash_op == 1))
      {
         /* We must leave PE mode to transfer next buffer to RAM */
         exit_pe_mode(flash_addr);

         /* Get maximum programming size that can currently be used. */
         num_byte_to_write = flash_get_program_size(bytes, flash_addr);

         /* Copy over up to next bytes */
         for(i = 0; i < num_byte_to_write; i++)
         {
            /* Copy over each byte */
            g_temp_array[i] = *((uint8_t *)(buffer_addr + i));
         }

         /* Re-enter PE mode, check if operation is successful */
         if(enter_pe_mode(flash_addr) != FLASH_SUCCESS)
         {
            /* Make sure part is in ROM read mode. */
            exit_pe_mode(flash_addr);

            /* Release state */
            flash_release_state2();

            /* Return operation failure */
            return FLASH_ERR_FAILURE;
         }
      }
#endif /* FLASH_CFG_FLASH_TO_FLASH */
#endif
   }

   /* Leave Program/Erase Mode */
   exit_pe_mode(entry_address);

   /* Release state */
   flash_release_state2();

   /* Return flash programming result */
   return result;
}

/*****************************************************************************
* Function Name: flash_api_control()
* Description  : This function supports additional configuration operations for
*                FCU enabled MCu's.
*                The supported commands are listed in the flash_cmd_t enum.
* Arguments    : flash_cmd_t cmd -
*                 command to be executed.
*                void *pcfg -
*                 Pointer to configuration. This argument can be NULL for
*                 commands that do not require a configuration.
*
*                Command                                |   Argument
*                FLASH_CMD_RESET------------------------| NULL
*                FLASH_CMD_STATUS_GET-------------------| NULL
* RX100 Series only:
*
*                FLASH_CMD_ACCESSWINDOW_SET----------------| void (*flash_access_window_config_t)(void *)
*                FLASH_CMD_LOCKBIT_READ--------------------| void (*flash_lockbit_config_t)(void *)
*                FLASH_CMD_LOCKBIT_PROTECTION--------------| void (*flash_lockbit_enable_t)(void *)
*                FLASH_CMD_LOCKBIT_PROGRAM-----------------| void (*flash_program_lockbit_config_t)(void *)
*
* Return Value : FLASH_SUCCESS -
*                    Operation completed successfully.
*                FLASH_ERR_FAILURE -
*                    Operation not available for this MCU
*                FLASH_ERR_ADRRESS -
*                    Address is an invalid Code/Data Flash block start address
*                FLASH_ERR_NULL_PTR -
*                    Pointer was NULL for a command that expects a configuration structure
*                FLASH_ERR_BUSY -
*                    Flash peripheral is busy with another operation or not initialized
*
******************************************************************************/
flash_err_t flash_api_control(flash_cmd_t cmd, void *pcfg) __attribute__((section(".flashCode")));
flash_err_t flash_api_control(flash_cmd_t cmd, void *pcfg)
{
   flash_err_t err = FLASH_SUCCESS;
   flash_access_window_config_t *pAccessInfo = pcfg;
#if((FLASH_CFG_CODE_FLASH_ENABLE == 1) && (FLASH_CFG_IGNORE_LOCK_BITS == 0))
   flash_read_lockbit_config_t *pLockBitConfig = pcfg;
   flash_lockbit_enable_t *pLockBitProtect = pcfg;
   flash_program_lockbit_config_t *pLockBitProgram = pcfg;
#endif

   (void)&pAccessInfo; /* Prevent compiler warning for not using 'pAccessInfo' AND not generate any code  */

#if(FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
   if((cmd != FLASH_CMD_RESET) && (cmd != FLASH_CMD_STATUS_GET))
   {
      if((pcfg == NULL) || (pcfg == FIT_NO_PTR))
      {
         return FLASH_ERR_PARAM;
      }
   }
#endif

   /*If the command is to reset the Flash, then no attempt is made to grab the lock
     * before executing the reset since the assumption is that the RESET command
     * is used to terminate any existing operation. */
   if(cmd == FLASH_CMD_RESET)
   {
      flash_release_state2();
      flash_reset(); // reset the flash circuit
      return err;
   }

   /*Check if API is busy*/
   if(g_flash_state != FLASH_READY)
   {
      // In blocking mode we will return busy if the flash state is busy no matter what
      return FLASH_ERR_BUSY; /* API not initialized or busy with another operation*/
   }

   switch(cmd)
   {
      case FLASH_CMD_ACCESSWINDOW_SET: // DF only
         flash_access_window_set(pAccessInfo);
         break;

      case FLASH_CMD_STATUS_GET:
         err = flash_getStatus();
         break;

#if((FLASH_CFG_CODE_FLASH_ENABLE == 1) && (FLASH_CFG_IGNORE_LOCK_BITS == 0))
      case FLASH_CMD_LOCKBIT_PROTECTION: // CF only
         err = flash_lockbit_protection(pLockBitProtect->enable);
         break;

      case FLASH_CMD_LOCKBIT_READ: // CF only
         err = flash_lockbit_read(pLockBitConfig);
         break;

      case FLASH_CMD_LOCKBIT_PROGRAM: // CF only
         err = flash_lockbit_program(pLockBitProgram);
         break;
#endif

      default:
         err = FLASH_ERR_PARAM;
   }
   flash_release_state2();
   return err;
}

